#+STARTUP: overview
*** 2017年10月份
    
   | 姓名   |   薪资 | 出勤天数 | 迟到天数 |   出勤报酬 | 迟到罚金 |   报销 |  实际工资 |
   |--------+--------+----------+----------+------------+----------+--------+-----------|
   | 李志虎 |   6500 |       20 |        0 |  4193.5484 |        0 |  212.3 | 4405.8484 |
   |--------+--------+----------+----------+------------+----------+--------+-----------|
   | 郭攀   |   7500 |     19.5 |        0 |  4717.7419 |        0 |        | 4717.7419 |
   |--------+--------+----------+----------+------------+----------+--------+-----------|
   | 杨晴   |  10500 |       18 |        0 |  6096.7742 |        0 |        | 6096.7742 |
   |--------+--------+----------+----------+------------+----------+--------+-----------|
   | 黄浩   |   6000 |     19.5 |        0 |  3774.1935 |        0 |        | 3774.1935 |
   |--------+--------+----------+----------+------------+----------+--------+-----------|
   | !      | 总薪资 | 平均出勤 | 平均迟到 | 总出勤报酬 |   总罚金 | 总报销 |    总支出 |
   |--------+--------+----------+----------+------------+----------+--------+-----------|
   |        |  31500 |    19.25 |        0 |  18782.258 |        0 |  212.3 | 18994.558 |
   |--------+--------+----------+----------+------------+----------+--------+-----------|
   #+TBLFM: $8=$5-$6+$7::$5=$2*$3/31::$6=$4*30
   #+TBLFM: @>$2=vsum(@<<$2..@>>>$2)::@>$5=vsum(@<<$5..@>>>$5)::@>$6=vsum(@<<$6..@>>>$6)
   #+TBLFM: @>$7=vsum(@<<$7..@>>>$7)::@>$3=vmean(@<<$3..@>>>$3)::@>$4=vmean(@<<$4..@>>>$4)
   #+TBLFM: @>$8=vsum(@<<$8..@>>>$8)

*** 2017年11月份

   | ! | 姓名         |   薪资 | 出勤天数 | 迟到天数 | 绩效 | 转正 |   出勤报酬 | 迟到罚金 | 报销费用 |  实际工资 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   |   | 李志虎       |   6500 |       22 |        0 |    1 |    1 |       6500 |        0 |      102 |      6602 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   |   | 郭攀         |   7500 |     21.5 |        7 |    1 |    1 |  7329.5455 |      210 |          | 7119.5455 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   | # | 杨晴 -离职   |  10500 |     14.5 |        0 |  0.8 |    1 |  5536.3636 |        0 |          | 5536.3636 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   |   | 黄浩         |   6000 |     21.5 |        9 |    1 |    1 |  5863.6364 |      270 |      246 | 5839.6364 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   |   | 梁家荣       |   3000 |       21 |        0 |    1 |    1 |  2863.6364 |        0 |          | 2863.6364 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   |   | 文伟军       |   8500 |       15 |        0 |    1 |  0.8 |  4636.3636 |        0 |          | 4636.3636 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   |   | 周冰清 -离职 |   3500 |       18 |        0 |  0.8 |  0.8 |  1832.7273 |        0 |          | 1832.7273 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   |   | 朱博文 -离职 |   5000 |       10 |        0 |  0.3 |  0.8 |  545.45455 |        0 |          | 545.45455 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   | ! |              | 总薪资 | 平均出勤 | 平均迟到 |      |      | 总出勤报酬 |   总罚金 |          |    总支出 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   | # | /            |  50500 |  17.9375 |        2 |      |  7.2 |  35107.727 |      480 |      348 | 34975.727 |
   |---+--------------+--------+----------+----------+------+------+------------+----------+----------+-----------|
   #+TBLFM: $8=$3*$6*$7*$4/22::$9=$5*30::$>=$8-$9+$10::@>$3=vsum(@<<$3..@>>>$3)::@>$8=vsum(@<<$8..@>>>$8)::@>$9=vsum(@<<$9..@>>>$9)::@>$10=vsum(@<<$10..@>>>$10)::@>$>=vsum(@<<$>..@>>>$>)::@>$4=vmean(@<<$4..@>>>$4)::@>$5=vmean(@<<$5..@>>>$5)

*** 2017年12月份

   | ! | 姓名   |   薪资 |  出勤天数 |  迟到天数 | 绩效 | 转正 |   出勤报酬 | 迟到罚金 | 报销费用 |  实际工资 |
   |---+--------+--------+-----------+-----------+------+------+------------+----------+----------+-----------|
   |   | 李志虎 |   6500 |        22 |         0 |    1 |    1 |       6500 |        0 |          |      6500 |
   |---+--------+--------+-----------+-----------+------+------+------------+----------+----------+-----------|
   |   | 郭攀   |   7500 |      18.5 |         0 |    1 |    1 |  6306.8182 |        0 |          | 6306.8182 |
   |---+--------+--------+-----------+-----------+------+------+------------+----------+----------+-----------|
   |   | 黄浩   |   6000 |        21 |         8 |  0.8 |    1 |  4581.8182 |      240 |          | 4341.8182 |
   |---+--------+--------+-----------+-----------+------+------+------------+----------+----------+-----------|
   |   | 梁家荣 |   3000 |        21 |         0 |  0.9 |    1 |  2577.2727 |        0 |          | 2577.2727 |
   |---+--------+--------+-----------+-----------+------+------+------------+----------+----------+-----------|
   |   | 文伟军 |   8500 |        22 |         0 |  0.8 |    1 |      6800. |        0 |          |     6800. |
   |---+--------+--------+-----------+-----------+------+------+------------+----------+----------+-----------|
   |   | 胡淳杰 |   5000 |        22 |         0 |  0.7 |    1 |      3500. |        0 |          |     3500. |
   |---+--------+--------+-----------+-----------+------+------+------------+----------+----------+-----------|
   | ! |        | 总薪资 |  平均出勤 |  平均迟到 |      |      | 总出勤报酬 |   总罚金 |          |    总支出 |
   |---+--------+--------+-----------+-----------+------+------+------------+----------+----------+-----------|
   | # | /      |  36500 | 21.083333 | 1.3333333 |      |  7.2 |  30265.909 |      240 |        0 | 30025.909 |
   |---+--------+--------+-----------+-----------+------+------+------------+----------+----------+-----------|
   #+TBLFM: $8=$3*$6*$7*$4/22::$9=$5*30::$>=$8-$9+$10::@>$3=vsum(@<<$3..@>>>$3)::@>$8=vsum(@<<$8..@>>>$8)::@>$9=vsum(@<<$9..@>>>$9)::@>$10=vsum(@<<$10..@>>>$10)::@>$>=vsum(@<<$>..@>>>$>)::@>$4=vmean(@<<$4..@>>>$4)::@>$5=vmean(@<<$5..@>>>$5)

*** 2018年1月份

   | ! | 姓名   |   薪资 |  出勤天数 | 迟到天数 | 绩效 | 转正 |   出勤报酬 | 迟到罚金 | 报销费用 |  实际工资 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+-----------|
   |   | 李志虎 |   6500 |        22 |        0 |    1 |    1 |       6500 |        0 |          |      6500 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+-----------|
   | # | 郭攀   |   7500 |        17 |        0 |    1 |    1 |  5795.4545 |        0 |          | 5795.4545 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+-----------|
   | # | 黄浩   |   6000 |        14 |        6 |  0.8 |    1 |  3054.5455 |      180 |          | 2874.5455 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+-----------|
   | # | 梁家荣 |   3000 |        21 |        0 |    1 |    1 |  2863.6364 |        0 |          | 2863.6364 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+-----------|
   |   | 文伟军 |   8500 |        22 |        0 |    1 |    1 |       8500 |        0 |          |      8500 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+-----------|
   | # | 胡淳杰 |   5000 |        22 |        0 |    1 |  0.8 |      4000. |        0 |          |     4000. |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+-----------|
   | ! |        | 总薪资 |  平均出勤 | 平均迟到 |      |      | 总出勤报酬 |   总罚金 |          |    总支出 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+-----------|
   | # | /      |  36500 | 19.666667 |        1 |      |  7.2 |  30713.636 |      180 |        0 | 30533.636 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+-----------|
   #+TBLFM: $8=$3*$6*$7*$4/22::$9=$5*30::$>=$8-$9+$10::@>$3=vsum(@<<$3..@>>>$3)::@>$8=vsum(@<<$8..@>>>$8)::@>$9=vsum(@<<$9..@>>>$9)::@>$10=vsum(@<<$10..@>>>$10)::@>$>=vsum(@<<$>..@>>>$>)::@>$4=vmean(@<<$4..@>>>$4)::@>$5=vmean(@<<$5..@>>>$5)

*** 2018年4月份

   | ! | 姓名   |   薪资 |  出勤天数 | 迟到天数 | 绩效 | 转正 |   出勤报酬 | 迟到罚金 | 报销费用 | 实际工资 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   |   | 李志虎 |  10000 |        20 |        0 |    1 |    1 |      10000 |        0 |          |    10000 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   |   | 邓权   |   7000 |        20 |        0 |    1 |    1 |       7000 |        0 |          |     7000 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   |   | 文伟军 |   8500 |        20 |        0 |    1 |    1 |       8500 |        0 |          |     8500 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   |   | 张潘   |   4000 |        13 |        0 |    1 |    1 |       2600 |        0 |          |     2600 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   |   | 胡伟   |   4500 |        13 |        0 |    1 |    1 |       2925 |        0 |          |     2925 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   |   | 许诗韵 |   5000 |        15 |        0 |    1 |    1 |       3750 |        0 |          |     3750 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   |   | 严一飞 |   3000 |        20 |        0 |    1 |    1 |       3000 |        0 |          |     3000 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   |   | 骆兵兵 |   3000 |        20 |        0 |    1 |    1 |       3000 |        0 |          |     3000 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   |   | 皮郑华 |   3000 |         4 |        0 |    1 |    1 |        600 |        0 |          |      600 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   | ! |        | 总薪资 |  平均出勤 | 平均迟到 |      |      | 总出勤报酬 |   总罚金 |          |   总支出 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   | # | /      |  48000 | 16.111111 |        0 |      |  7.2 |      41375 |        0 |        0 |    41375 |
   |---+--------+--------+-----------+----------+------+------+------------+----------+----------+----------|
   #+TBLFM: $8=$3*$6*$7*$4/20::$9=$5*30::$>=$8-$9+$10::@>$3=vsum(@<<$3..@>>>$3)::@>$8=vsum(@<<$8..@>>>$8)::@>$9=vsum(@<<$9..@>>>$9)::@>$10=vsum(@<<$10..@>>>$10)::@>$>=vsum(@<<$>..@>>>$>)::@>$4=vmean(@<<$4..@>>>$4)::@>$5=vmean(@<<$5..@>>>$5)

*** 2018年5月份
  | ! | 姓名   |   薪资 | 出勤天数 | 迟到天数 | 绩效 | 转正 |   出勤报酬 | 迟到罚金 | 报销费用 |  实际工资 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 李志虎 |  10000 |       22 |        0 |    1 |    1 |      10000 |        0 |    -4000 |      6000 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 邓权   |   7000 |       22 |        0 |    1 |    1 |       7000 |        0 |    -7000 |         0 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 文伟军 |   8500 |       22 |        0 |    1 |    1 |       8500 |        0 |          |      8500 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 张潘   |   4000 |       11 |        0 |    1 |    1 |       2000 |        0 |          |      2000 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 胡伟   |   4500 |       22 |        0 |    1 |    1 |       4500 |        0 |          |      4500 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 许诗韵 |   5000 |       22 |        0 |    1 |    1 |       5000 |        0 |          |      5000 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 严一飞 |   3000 |       21 |        0 |    1 |    1 |  2863.6364 |        0 |          | 2863.6364 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 骆兵兵 |   3000 |       22 |        0 |    1 |    1 |       3000 |        0 |          |      3000 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 皮郑华 |   3000 |       22 |        0 |    1 |    1 |       3000 |        0 |          |      3000 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | 肖伟明 |   3000 |       14 |        0 |    1 |    1 |  1909.0909 |        0 |          | 1909.0909 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | ! |        | 总薪资 | 平均出勤 | 平均迟到 |      |      | 总出勤报酬 |   总罚金 |          |    总支出 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  | # | /      |  51000 |       20 |        0 |      |  7.2 |  47772.727 |        0 |   -11000 | 36772.727 |
  |---+--------+--------+----------+----------+------+------+------------+----------+----------+-----------|
  #+TBLFM: $8=$3*$6*$7*$4/22::$9=$5*30::$>=$8-$9+$10::@>$3=vsum(@<<$3..@>>>$3)::@>$8=vsum(@<<$8..@>>>$8)::@>$9=vsum(@<<$9..@>>>$9)::@>$10=vsum(@<<$10..@>>>$10)::@>$>=vsum(@<<$>..@>>>$>)::@>$4=vmean(@<<$4..@>>>$4)::@>$5=vmean(@<<$5..@>>>$5)

*** 2018年6月份
  | ! | 姓名     |   薪资 |  出勤天数 | 迟到天数 | 绩效 | 转正 |   出勤报酬 | 迟到罚金 | 报销费用 | 实际工资 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 1李志虎  |  10000 |        20 |        0 |    1 |    1 |      10000 |        0 |          |    10000 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 3邓权    |   7000 |      19.5 |        0 |    1 |    1 |      6825. |        0 |     1000 |    7825. |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 2文伟军  |   8500 |        20 |        0 |    1 |    1 |       8500 |        0 |          |     8500 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 6胡伟    |   4500 |        19 |        0 |    1 |    1 |       4275 |        0 |          |     4275 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 5许诗韵  |   5000 |      17.5 |        0 |    1 |    1 |      4375. |        0 |          |    4375. |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 4严一飞  |   3000 |      18.5 |        0 |    1 |    1 |      2775. |        0 |          |    2775. |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 7肖伟明  |   3000 |        19 |        0 |    1 |    1 |       2850 |        0 |          |     2850 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 8江梦琳  |   3000 |        19 |          |    1 |    1 |       2850 |        0 |          |     2850 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 9喻进环  |   3000 |        15 |          |    1 |    1 |       2250 |        0 |          |     2250 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 10王翼羽 |   4000 |        14 |          |    1 |    1 |       2800 |        0 |          |     2800 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 11沈豪   |   3000 |         5 |          |    1 |    1 |        750 |        0 |          |      750 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  | ! |          | 总薪资 |  平均出勤 | 平均迟到 |      |      | 总出勤报酬 |   总罚金 |          |   总支出 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  | # | /        |  54000 | 16.954545 |        0 |      |  7.2 |     48250. |        0 |     1000 |   49250. |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  #+TBLFM: $8=$3*$6*$7*$4/20::$9=$5*30::$>=$8-$9+$10::@>$3=vsum(@<<$3..@>>>$3)::@>$8=vsum(@<<$8..@>>>$8)::@>$9=vsum(@<<$9..@>>>$9)::@>$10=vsum(@<<$10..@>>>$10)::@>$>=vsum(@<<$>..@>>>$>)::@>$4=vmean(@<<$4..@>>>$4)::@>$5=vmean(@<<$5..@>>>$5)

*** 2018年7月份
  | ! | 姓名     |   薪资 |  出勤天数 | 迟到天数 | 绩效 | 转正 |   出勤报酬 | 迟到罚金 | 报销费用 | 实际工资 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 1李志虎  |  10000 |        20 |        0 |    1 |    1 |      10000 |        0 |          |    10000 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 3邓权    |   7000 |      19.5 |        0 |    1 |    1 |      6825. |        0 |     1000 |    7825. |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 2文伟军  |   8500 |        20 |        0 |    1 |    1 |       8500 |        0 |          |     8500 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  | # | 6胡伟    |   4500 |        19 |        0 |    1 |    1 |       4275 |        0 |          |     4275 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 4严一飞  |   3000 |      18.5 |        0 |    1 |    1 |      2775. |        0 |          |    2775. |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 7肖伟明  |   3000 |        19 |        0 |    1 |    1 |       2850 |        0 |          |     2850 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 8江梦琳  |   3000 |        19 |          |    1 |    1 |       2850 |        0 |          |     2850 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 9喻进环  |   3000 |        15 |          |    1 |    1 |       2250 |        0 |          |     2250 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  | # | 10王翼羽 |   4000 |        14 |          |    1 |    1 |       2800 |        0 |          |     2800 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  |   | 11沈豪   |   3000 |         5 |          |    1 |    1 |        750 |        0 |          |      750 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  | ! |          | 总薪资 |  平均出勤 | 平均迟到 |      |      | 总出勤报酬 |   总罚金 |          |   总支出 |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  | # | /        |  54000 | 16.954545 |        0 |      |  7.2 |     48250. |        0 |     1000 |   49250. |
  |---+----------+--------+-----------+----------+------+------+------------+----------+----------+----------|
  #+TBLFM: $8=$3*$6*$7*$4/20::$9=$5*30::$>=$8-$9+$10::@>$3=vsum(@<<$3..@>>>$3)::@>$8=vsum(@<<$8..@>>>$8)::@>$9=vsum(@<<$9..@>>>$9)::@>$10=vsum(@<<$10..@>>>$10)::@>$>=vsum(@<<$>..@>>>$>)::@>$4=vmean(@<<$4..@>>>$4)::@>$5=vmean(@<<$5..@>>>$5)

